mosdolg-nifi/ehd/push/examples/notify_catalog.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rec="http://op.mos.ru/receive_changes">
    <soapenv:Header/>
    <soapenv:Body>
        <rec:ChangeElement>
            <rec:in><![CDATA[объект]]></rec:in>
        </rec:ChangeElement>
    </soapenv:Body>
</soapenv:Envelope>